# Задание №2
# 📌 Напишите для задачи 1 тесты doctest. Проверьте
# следующие варианты:
# 📌 возврат строки без изменений
# 📌 возврат строки с преобразованием регистра без потери символов
# 📌 возврат строки с удалением знаков пунктуации
# 📌 возврат строки с удалением букв других алфавитов
# 📌 возврат строки с учётом всех вышеперечисленных пунктов
# (кроме п. 1)

import doctest
# doctest.testfile('task2_test_1.md', verbose=True)
# doctest.testfile('task2_test_2.md', verbose=True)
# doctest.testfile('task2_test_3.md', verbose=True)
# doctest.testfile('task2_test_4.md', verbose=True)
# doctest.testfile('task2_test_5.md', verbose=True)
doctest.testfile('task2_test_all.md', verbose=True)